#include <iostream>

using namespace std;

/**
 * По подадено 3-цифрено число изведете числото кодирано чрез букви
 * от латинската азбука както следва: (0 -> a, 1 -> b, 2 -> c, ...)
 */
int main()
{
    short num;
    cin >> num;

    // Константа - за да можем лесно при нужда да променим началната буква
    const char  BEGIN_CHAR  = 'a';

    // Забележка: Типа char също е число с големина 1 байт [-127; 128]
    //  При извеждането на променлива от тип char на стандартния изход
    //  тази числова стойност се заменя със символ от ASCII таблицата.
    char ch1 = BEGIN_CHAR + ( num / 100 );
    char ch2 = BEGIN_CHAR + ( ( num / 10 ) % 10 );
    char ch3 = BEGIN_CHAR + ( num % 10 );

    cout << ch1 << ch2 << ch3;

    return 0;
}
