//Да се напише програма, която по въведено цяло положително число n,
//да се прочитат на брой цели числа, а след това да се отпечатва сумата от цифрите им.

#include<iostream>

int main() {

	int n;
	std::cin >> n;

	int sum = 0;
	int current = 0;

	do {
		std::cin >> current;

		while (current) {
			sum += current % 10;
			current /= 10;
		}

		n--;
	} while (n);

	std::cout << sum << std::endl;

	return 0;
}

/*Да се напише програма, която пресмята и отпечатва:
- стойността на израза 1 - 1/2 + 1/3 - 1/4 + ... + (-1)^(n-1)*1/n;*/

/*Да се напише програма, която да определя дали дадено число е “нарцистично”. Число n се 
нарича нарцистично, ако изпълнява следното условие: n = (ak)^k + (ak-1)^k + … + (a2)^k + (a1)^k, 
тоест сумата от цифрите на числото, повдигнати на степен броя на цифрите, да е самото число.*/

/*Да се напише програма, която печата всички четирицифрени числа, чиито сбор на първите две 
цифри е равен на сбора на вторите две цифри.*/