//Задача трета
#include <iostream>
using namespace std;

int main()
{
	int a = 0;
	cin >> a;
	cout << !(a % 2); // Ако а е четно, то дава остатък 0 при деление на две.
	//Знаем, че !(0) => 1
}