//Задача първа
#include <iostream>
using namespace std;

int main()
{
	int a = 0; //Декларира променлива от целочислен тип
	cin >> a; //Въвежда стойността й с функцията cin
	cout << (bool)(a); //Каства променливата към тип bool и я отпечатва 
	//на конзолата с функцията cout
}
