#include <iostream>
#include <cmath>

using namespace std;

/**
 * Изведете най-близката степен на 2, която е по-голяма от
 * подадено цяло неотрицателно число N (без цикли!).
 */
int main()
{
    int day;
    cin >> day;

    // Математика: 2^x > n  <=>  x > log2( n ) 
    // Търсим най-малката експонента (степен) х
    // удовлетворяваща неравенството x > log2( n )

    cout << (int)log2( day ) + 1;

    // Втори начин:
    // cout << ceil( log2( day + 1 ) );
    //
    // Тъй като търсим степен на двойката по-голяма от подаденото число,
    // то увеличаваме подаденото число с едно за да не получим точната
    // степен на двойката и съответно закръгляме нагоре.

    return 0;
}
